{
  "backend/main.mo": "Motoko actor storing visitor messages in a list with functions to submit and retrieve all messages.",
  "feature_evidence.json": "Feature evidence report mapping high-level UI features to related frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing responsibilities of all major frontend components, hooks, and sections.",
  "frontend/index.css": "Tailwind base stylesheet defining CSS variables for light/dark themes and global styling.",
  "frontend/index.html": "Main HTML entry file with SEO metadata, fonts, favicon, and root div for mounting the React app.",
  "frontend/src/App.tsx": "Root React component configuring theme, React Query, navigation, sections, and layout structure.",
  "frontend/src/components/AnimatedSection.tsx": "Wrapper component that animates child content into view using IntersectionObserver and motion preferences.",
  "frontend/src/components/Figure.tsx": "Reusable figure component for images with optional captions and responsive styling.",
  "frontend/src/components/Footer.tsx": "Footer component with about text, quick links, social icons, and dynamic year.",
  "frontend/src/components/QuoteCards.tsx": "Component rendering styled quote cards with gold accents and optional authors.",
  "frontend/src/components/sections/ContactSection.tsx": "Contact form section with client-side validation and message submission via a custom hook, showing a success state after sending.",
  "frontend/src/components/sections/DocumentarySection.tsx": "Documentary content section displaying styled narrative text and quotes about Hazrat Sakhi Habib Sultan Nangiana.",
  "frontend/src/components/sections/GallerySection.tsx": "Image gallery section with a grid of photos and a lightbox viewer supporting navigation and keyboard controls.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero banner with background imagery, title, and a call-to-action button that scrolls smoothly to the documentary section.",
  "frontend/src/components/sections/ReflectionSection.tsx": "Renders a themed reflection section with decorative elements and religious narrative text about patience and trust. Uses AnimatedSection and Heart icon for visual emphasis.",
  "frontend/src/components/sections/ShrineLegacySection.tsx": "Displays shrine information, spiritual legacy descriptions, and animated statistical counters. Combines icons, text blocks, and count-up components in a styled layout.",
  "frontend/src/components/sections/StorytellingSection.tsx": "Provides a storytelling card explaining the origin of the Nangiana name with decorative effects. Uses Card components, icons, and narrative paragraphs.",
  "frontend/src/components/sections/TimelineSection.tsx": "Shows a four-item spiritual timeline with icons and descriptions inside animated, styled cards. Iterates through predefined timeline items within a grid layout.",
  "frontend/src/components/SpiritualModeToggle.tsx": "Toggle button that enables a session-persisted “spiritual mode” and controls playback of a looping ambient audio clip.",
  "frontend/src/components/StickyNav.tsx": "Sticky top navigation bar with scroll progress, section highlighting, mobile menu, and integrated spiritual mode toggle.",
  "frontend/src/hooks/useActiveSection.ts": "Tracks which section is currently visible using IntersectionObserver and returns the active section ID. Updates state when observed elements intersect the viewport.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor using Internet Identity and react-query. Recreates and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useCountUpOnView.ts": "Animates a count-up effect when an element becomes visible using IntersectionObserver and easing. Supports reduced-motion preferences and returns a ref and current count.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login, logout, and identity loading. Wraps AuthClient setup and exposes identity state and status flags.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Detects user's reduced-motion preference via a media query and updates state on changes.",
  "frontend/src/hooks/useScrollProgress.ts": "Provides a hook that calculates and updates scroll progress as a percentage.",
  "frontend/src/hooks/useSessionState.ts": "Implements sessionStorage-backed state with automatic persistence and initialization.",
  "frontend/src/hooks/useSubmitVisitorMessage.ts": "Defines a React Query mutation for submitting visitor messages using an actor and shows toast notifications.",
  "frontend/src/index.css": "Defines Tailwind base styles, custom theme variables, and component utilities for the emerald-gold design system.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, animations, and plugins aligned with the site's theme.",
  "project_state.json": "Stores project configuration, goals, features, image requirements, and architectural notes for the build."
}