{
  "backend/main.mo": "Motoko actor storing visitor messages in a list with functions to submit and retrieve all messages.",
  "backend/migration.mo": "Migration module that defines message and actor types and returns the existing actor state unchanged.",
  "feature_evidence.json": "Evidence report listing features, affected frontend files, components, and test IDs for deployment‑related fixes.",
  "frontend-file-summaries.txt": "JSON-style mapping summarizing the purpose of all major frontend components, hooks, and sections.",
  "frontend/DEPLOYMENT_AUDIT_NOTES.md": "Notes outlining required Vite build behavior, IC asset‑serving rules, and checks to ensure no /src/* file requests in production.",
  "frontend/index.css": "Tailwind CSS base and theme variables defining light/dark color tokens and global styling.",
  "frontend/index.html": "HTML entrypoint with metadata, fonts, favicon, and root div; relies on Vite to inject scripts during build.",
  "frontend/src/App.tsx": "Main React app composing all sections with dark theme enforcement and smooth scrolling.",
  "frontend/src/components/AnimatedSection.tsx": "Wrapper component adding fade/slide‑in animations using IntersectionObserver with reduced‑motion support.",
  "frontend/src/components/Figure.tsx": "Simple figure component rendering an image with optional caption and styling.",
  "frontend/src/components/Footer.tsx": "Footer containing about text, quick links, social icons, and dynamic year handling.",
  "frontend/src/components/QuoteCards.tsx": "Component rendering styled quote cards with decorative elements and optional authors.",
  "frontend/src/components/sections/ContactSection.tsx": "A contact form with validation and submission via a custom hook, showing success and error states.",
  "frontend/src/components/sections/DocumentarySection.tsx": "A content-heavy section presenting biographical and narrative text with quotes about Hazrat Sakhi Habib Sultan Nangiana.",
  "frontend/src/components/sections/GallerySection.tsx": "A gallery displaying shrine-related images with an animated grid and a lightbox for viewing and navigating photos.",
  "frontend/src/components/sections/HeroSection.tsx": "A hero banner with a blurred background image, title text, and a button that scrolls to the documentary section.",
  "frontend/src/components/sections/ReflectionSection.tsx": "A styled section displaying a spiritual reflection story with decorative elements and text about patience and faith.",
  "frontend/src/components/sections/ShrineLegacySection.tsx": "Renders a shrine description and animated counters highlighting legacy metrics using IntersectionObserver-driven animations.",
  "frontend/src/components/sections/StorytellingSection.tsx": "A storytelling card explaining the origin of the Nangiana name with styled text, quotes, and visual embellishments.",
  "frontend/src/components/sections/TimelineSection.tsx": "Displays a four‑item spiritual timeline with icons and animated section entries using a grid layout.",
  "frontend/src/components/SpiritualModeToggle.tsx": "A toggle button that controls a looping ambient audio track using session state, handling mute and autoplay behavior.",
  "frontend/src/components/StickyNav.tsx": "A fixed navigation bar with scroll-based progress, active section highlighting, mobile menu support, and a spiritual mode toggle.",
  "frontend/src/hooks/useActiveSection.ts": "Tracks and returns the currently visible section ID using an IntersectionObserver.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useCountUpOnView.ts": "Provides a hook that animates counting up to a target number when an element enters view, with reduced‑motion support.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity context, handling login, stored identity loading, and auth‑client setup and state.",
  "frontend/src/hooks/usePrefersReducedMotion.ts": "Returns whether the user prefers reduced motion by listening to the relevant media query.",
  "frontend/src/hooks/useScrollProgress.ts": "A React hook that tracks scroll position and returns page scroll progress as a percentage with event listeners for scroll and resize.",
  "frontend/src/hooks/useSessionState.ts": "A React hook that syncs a state value with sessionStorage, initializing from storage and persisting updates.",
  "frontend/src/hooks/useSubmitVisitorMessage.ts": "A React Query mutation hook that submits a visitor message via an actor, shows toast notifications, and refreshes the messages query.",
  "frontend/src/index.css": "Tailwind base/theme CSS defining an emerald–gold design system, dark mode variables, and custom components like glass cards and documentary typography.",
  "frontend/src/main.tsx": "Application entry point that initializes React, wraps the app with InternetIdentity and React Query providers, and loads global styles.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, typography, animations, and design tokens using CSS variables for the theme.",
  "frontend/vite.config.ts": "Vite configuration with React plugin, environment variable injection, path aliasing, build output settings, and a dev server proxy.",
  "project_state.json": "Project metadata describing requirements, architecture, known issues, and existing implemented features for the documentary website."
}