{
  "kind": "build_request",
  "title": "Perform full codebase audit and apply all deployment/runtime fixes in one pass (stop loading /src/main.tsx on IC)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-22",
      "text": "Perform a full-project audit (frontend entrypoints, build output, and IC static asset serving configuration) and apply all necessary deployment/runtime fixes in a single update so the production canister serves the built Vite output instead of trying to load TypeScript source files.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "then check the whole program and replace all things at once not turn wise"
        ]
      },
      "acceptanceCriteria": [
        "The deployed site loads successfully on the Internet Computer without browser “connection reset” / unreachable behavior.",
        "In production, the browser Network tab shows the app is loaded from built assets (e.g., `/assets/*.js`, `/assets/*.css`) and does not request `/src/main.tsx` or any `/src/*` paths.",
        "No runtime crash occurs during initial render (blank screen), and the app reaches the Hero section UI.",
        "All changes are delivered together (one rebuild/redeploy) rather than multiple incremental partial fixes."
      ]
    },
    {
      "id": "REQ-23",
      "text": "Fix the frontend HTML entry so it is compatible with production Vite builds on the Internet Computer by removing the hardcoded `<script type='module' src='/src/main.tsx'></script>` from `frontend/index.html` and ensuring the built `index.html` correctly references the compiled assets produced by Vite during the production build.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "replace all things at once not turn wise"
        ]
      },
      "acceptanceCriteria": [
        "`frontend/index.html` no longer includes a script tag pointing to `/src/main.tsx`.",
        "After running a production build, the generated `dist/index.html` references compiled asset paths under `/assets/` (hashed filenames are acceptable).",
        "When deployed, loading the site does not produce 404s for `/src/main.tsx` and the main JS bundle is fetched successfully."
      ]
    }
  ],
  "constraints": [
    "Do not edit any files under `frontend/src/hooks/useInternetIdentity.ts`, `frontend/src/hooks/useInternetIdentity.tsx`, `frontend/src/hooks/useActor.ts`, `frontend/src/main.tsx`, `frontend/src/main.tsx`, or anything in `frontend/src/components/ui` (immutable paths must not be modified).",
    "Backend must remain a single Motoko actor with all logic in `backend/main.mo`; add `backend/migration.mo` only if an existing stable state upgrade requires it.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Adding new sections, new content, or redesigning the site UI beyond what is required to fix deployment/runtime issues.",
    "Introducing external databases, servers, or non-supported backend technologies.",
    "Adding real-time features (WebSockets), third-party auth providers, or any non-Internet-Identity authentication."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}