{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Stabilize Vite production boot by removing next-themes, deduping React Query provider, and serving built assets",
  "requirements": [
    {
      "id": "REQ-19",
      "summary": "Remove Next.js-only next-themes usage so the Vite React app boots without runtime crashes while keeping the existing emerald/gold styling.",
      "acceptanceCriteria": [
        "`frontend/src/App.tsx` no longer imports or uses `ThemeProvider` from `next-themes`.",
        "The app renders successfully in production without a blank page or runtime error related to theming.",
        "No user-facing text is changed as part of this fix (except any unavoidable error messages being removed by virtue of the crash being fixed)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove the `next-themes` import and `ThemeProvider` wrapper. Preserve the current dark (emerald/gold) look by setting the initial theme class on the document element (e.g., ensure the `dark` class is applied consistently) without changing any user-facing text."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Ensure the root document has the expected theme class behavior on first paint (e.g., set the `dark` class at the document level if required) to preserve the existing emerald/gold styling after removing `next-themes`, without changing any user-facing text."
        }
      ]
    },
    {
      "id": "REQ-20",
      "summary": "Ensure React Query is configured with exactly one QueryClientProvider at runtime without editing immutable paths.",
      "acceptanceCriteria": [
        "The app uses a single `QueryClientProvider` (no nested/duplicated providers).",
        "The change does not require editing `frontend/src/main.tsx` (immutable).",
        "React Query continues to function for visitor message submission (no runtime errors, mutation still works)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove the local `QueryClient` instantiation and the `QueryClientProvider` wrapper from `App`, relying on the existing provider in `frontend/src/main.tsx` (immutable). Ensure the component tree still renders and React Query hooks (e.g., visitor message submission) continue working."
        }
      ]
    },
    {
      "id": "REQ-21",
      "summary": "Adjust the frontend build configuration and shipped HTML so production serves built Vite assets instead of TypeScript source paths, preventing connection reset/blank page on deployment.",
      "acceptanceCriteria": [
        "The deployed site opens successfully in a browser (no “connection reset”, no blank page).",
        "The production `index.html` served by the canister references built asset files (e.g., `/assets/...js`) rather than `/src/main.tsx`.",
        "A fresh load (hard refresh) works and all sections (Hero, Documentary, Timeline, Reflection, Legacy, Story, Gallery, Contact) render."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the production-served HTML to load compiled assets from the `/assets/` directory (and not `/src/main.tsx`). Keep existing metadata/content unchanged; only adjust the asset loading references required for production to boot."
        },
        {
          "path": "frontend/vite.config.ts",
          "operation": "create",
          "description": "Add a Vite configuration that builds predictable, deployable asset filenames under an `assets/` directory (and appropriate base path) so `frontend/index.html` can reference compiled JS/CSS reliably in production and hard refreshes work."
        }
      ]
    }
  ]
}