{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix Vite/IC production static serving to load built assets instead of /src",
  "requirements": [
    {
      "id": "REQ-22",
      "summary": "Audit and update frontend build/entry configuration so the deployed IC site serves Vite-built assets and renders through the Hero section without requesting /src paths.",
      "acceptanceCriteria": [
        "The deployed site loads successfully on the Internet Computer without browser “connection reset” / unreachable behavior.",
        "In production, the browser Network tab shows the app is loaded from built assets (e.g., `/assets/*.js`, `/assets/*.css`) and does not request `/src/main.tsx` or any `/src/*` paths.",
        "No runtime crash occurs during initial render (blank screen), and the app reaches the Hero section UI.",
        "All changes are delivered together (one rebuild/redeploy) rather than multiple incremental partial fixes."
      ],
      "file_operations": [
        {
          "path": "frontend/vite.config.ts",
          "operation": "modify",
          "description": "Adjust Vite production build settings to generate an IC-friendly, self-contained dist output (asset paths and output naming) so the deployed site loads compiled assets under /assets and avoids any runtime references to /src."
        },
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Align the HTML entry with the production static-asset strategy so the deployed canister serves a built-asset-based entry and does not trigger /src/* requests at runtime."
        },
        {
          "path": "frontend/DEPLOYMENT_AUDIT_NOTES.md",
          "operation": "create",
          "description": "Document the verified production build + IC static serving expectations for this repo (what must be deployed from the Vite dist output, and what network requests should be observed in production) to prevent regressions."
        }
      ]
    },
    {
      "id": "REQ-23",
      "summary": "Remove the hardcoded /src/main.tsx module script from frontend/index.html and ensure the production build references compiled /assets outputs.",
      "acceptanceCriteria": [
        "`frontend/index.html` no longer includes a script tag pointing to `/src/main.tsx`.",
        "After running a production build, the generated `dist/index.html` references compiled asset paths under `/assets/` (hashed filenames are acceptable).",
        "When deployed, loading the site does not produce 404s for `/src/main.tsx` and the main JS bundle is fetched successfully."
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Remove the hardcoded `<script type='module' src='/src/main.tsx'></script>` and replace it with a production-compatible reference pattern that loads the compiled bundle(s) from /assets in production."
        },
        {
          "path": "frontend/vite.config.ts",
          "operation": "modify",
          "description": "Update Vite build configuration as needed so the compiled asset filenames/paths produced during production build match what the production HTML entry expects (ensuring dist/index.html references /assets outputs)."
        }
      ]
    }
  ]
}